tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf27j13_tdd.h
#define RCREG2                        1091
#define SPBRG2                        1092
#define RCSTA1                        1093
#define RCSTA1_RX9D                   1094
#define RX9D1                         1095
#define RCD8                          1096
#define RCSTA1_OERR                   1097
#define OERR1                         1098
#define RCSTA1_FERR                   1099
#define FERR1                         1100
#define RCSTA1_ADDEN                  1101
#define ADDEN1                        1102
#define ADEN                          1103
#define RCSTA1_CREN                   1104
#define CREN1                         1105
#define SRENA                         1106
#define SREN1                         1107
#define RCSTA1_SREN                   1108
#define RC8_9                         1109
#define RCSTA1_RX9                    1110
#define nRC8                          1111
#define NOT_RC8                       1112
#define RC9                           1113
#define RX91                          1114
#define RCSTA1_SPEN                   1115
#define SPEN1                         1116
#define TXSTA1                        1117
#define TX9D1                         1118
#define TXSTA1_TX9D                   1119
#define TXD8                          1120
#define TRMT1                         1121
#define TXSTA1_TRMT                   1122
#define BRGH1                         1123
#define TXSTA1_BRGH                   1124
#define TXSTA1_SENDB                  1125
#define SENDB1                        1126
#define TXSTA1_SYNC                   1127
#define SYNC1                         1128
#define TXEN1                         1129
#define TXSTA1_TXEN                   1130
#define TX91                          1131
#define TX8_9                         1132
#define NOT_TX8                       1133
#define nTX8                          1134
#define TXSTA1_TX9                    1135
#define TXSTA1_CSRC                   1136
#define CSRC1                         1137
#define TXREG1                        1138
#define RCREG1                        1139
#define SPBRG1                        1140
#define CTMUICON                      1141
#define IRNG                          1142
#define IRNG0                         1143
#define IRNG1                         1144
#define ITRIM0                        1145
#define ITRIM                         1146
#define ITRIM1                        1147
#define ITRIM2                        1148
#define ITRIM3                        1149
#define ITRIM4                        1150
#define ITRIM5                        1151
#define CTMUCONL                      1152
#define EDG1STAT                      1153
#define EDG2STAT                      1154
#define EDG1SEL0                      1155
#define EDG1SEL1                      1156
#define EDG1POL                       1157
#define EDG2SEL0                      1158
#define EDG2SEL1                      1159
#define EDG2POL                       1160
#define CTMUCONH                      1161
#define CTTRIG                        1162
#define IDISSEN                       1163
#define EDGSEQEN                      1164
#define EDGEN                         1165
#define TGEN                          1166
#define CTMUSIDL                      1167
#define CTMUEN                        1168
#define CCP2CON                       1169
#define CCP2M                         1170
#define CCP2M0                        1171
#define CCP2M1                        1172
#define CCP2M2                        1173
#define CCP2M3                        1174
#define DC2B                          1175
#define DC2B0                         1176
#define CCP2Y                         1177
#define DC2B1                         1178
#define CCP2X                         1179
#define P2M                           1180
#define P2M0                          1181
#define P2M1                          1182
#define CCPR2L                        1183
#define CCPR2H                        1184
#define ECCP2DEL                      1185
#define ECCP2DEL_P2DC0                1186
#define P2DC                          1187
#define ECCP2DEL_P2DC1                1188
#define ECCP2DEL_P2DC2                1189
#define ECCP2DEL_P2DC3                1190
#define ECCP2DEL_P2DC4                1191
#define ECCP2DEL_P2DC5                1192
#define ECCP2DEL_P2DC6                1193
#define P2RSEN                        1194
#define PSS2BD                        1195
#define PSS2BD0                       1196
#define PSS2BD1                       1197
#define PSS2AC0                       1198
#define PSS2AC                        1199
#define PSS2AC1                       1200
#define ECCP2AS0                      1201
#define ECCP2AS                       1202
#define ECCP2AS1                      1203
#define ECCP2AS2                      1204
#define ECCP2ASE                      1205
#define PSTR2CON                      1206
#define PSTR2CON_STRA                 1207
#define P2DC02                        1208
#define STRA2                         1209
#define P2DC0CON                      1210
#define PSTR2CON_P2DC0                1211
#define STRB2                         1212
#define P2DC12                        1213
#define PSTR2CON_STRB                 1214
#define PSTR2CON_P2DC1                1215
#define P2DC1CON                      1216
#define PSTR2CON_STRC                 1217
#define STRC2                         1218
#define PSTR2CON_P2DC2                1219
#define P2DC22                        1220
#define P2DC2CON                      1221
#define P2DC32                        1222
#define STRD2                         1223
#define PSTR2CON_STRD                 1224
#define P2DC3CON                      1225
#define PSTR2CON_P2DC3                1226
#define P2DC4CON                      1227
#define STRSYNC2                      1228
#define PSTR2CON_STRSYNC              1229
#define PSTR2CON_P2DC4                1230
#define P2DC42                        1231
#define P2DC52                        1232
#define P2DC5CON                      1233
#define PSTR2CON_P2DC5                1234
#define P2DC6CON                      1235
#define CMPL02                        1236
#define PSTR2CON_P2DC6                1237
#define P2DC62                        1238
#define PSTR2CON_CMPL0                1239
#define CMPL12                        1240
#define PSTR2CON_CMPL1                1241
#define CCP1CON                       1242
#define CCP1M0                        1243
#define CCP1M                         1244
#define CCP1M1                        1245
#define CCP1M2                        1246
#define CCP1M3                        1247
#define CCP1Y                         1248
#define DC1B                          1249
#define DC1B0                         1250
#define CCP1X                         1251
#define DC1B1                         1252
#define P1M                           1253
#define P1M0                          1254
#define P1M1                          1255
#define CCPR1L                        1256
#define CCPR1H                        1257
#define ECCP1DEL                      1258
#define P1DC                          1259
#define P1DC0                         1260
#define P1DC1                         1261
#define P1DC2                         1262
#define P1DC3                         1263
#define P1DC4                         1264
#define P1DC5                         1265
#define P1DC6                         1266
#define P1RSEN                        1267
#define PSS1BD0                       1268
#define PSS1BD                        1269
#define PSS1BD1                       1270
#define PSS1AC                        1271
#define PSS1AC0                       1272
#define PSS1AC1                       1273
#define ECCP1AS                       1274
#define ECCP1AS0                      1275
#define ECCP1AS1                      1276
#define ECCP1AS2                      1277
#define ECCP1ASE                      1278
#define PSTR1CON                      1279
#define PSTR1CON_STRA                 1280
#define PSTR1CON_STRB                 1281
#define PSTR1CON_STRC                 1282
#define PSTR1CON_STRD                 1283
#define PSTR1CON_STRSYNC              1284
#define PSTR1CON_CMPL0                1285
#define PSTR1CON_CMPL1                1286
#define WDTCON                        1287
#define SWDTEN                        1288
#define SWDTE                         1289
#define ULPSINK                       1290
#define ULPEN                         1291
#define DS                            1292
#define VBGOE                         1293
#define ULPLVL                        1294
#define LVDSTAT                       1295
#define REGSLP                        1296
#define ADCON1                        1297
#define ADCS0                         1298
#define ADCS                          1299
#define ADCS1                         1300
#define ADCS2                         1301
#define ACQT0                         1302
#define ACQT                          1303
#define CHSN3                         1304
#define ACQT1                         1305
#define VCFG01                        1306
#define ACQT2                         1307
#define VCFG11                        1308
#define ADCON1_ADCAL                  1309
#define ADFM                          1310
#define ADCON0                        1311
#define ADON                          1312
#define nDONE                         1313
#define GO_nDONE                      1314
#define NOT_DONE                      1315
#define GODONE                        1316
#define GO_DONE                       1317
#define DONE                          1318
#define GO                            1319
#define GO_NOT_DONE                   1320
#define CHS                           1321
#define CHS0                          1322
#define CHS1                          1323
#define CHS2                          1324
#define CHS3                          1325
#define VCFG                          1326
#define VCFG0                         1327
#define VCFG1                         1328
#define ADCON0_ADCAL                  1329
#define ADRESL                        1330
#define ADRESH                        1331
#define SSP1CON2                      1332
#define SEN1                          1333
#define SSP1CON2_SEN                  1334
#define ADMSK11                       1335
#define SSP1CON2_RSEN                 1336
#define RSEN1                         1337
#define SSP1CON2_ADMSK1               1338
#define SSP1CON2_PEN                  1339
#define ADMSK21                       1340
#define PEN1                          1341
#define SSP1CON2_ADMSK2               1342
#define ADMSK31                       1343
#define RCEN1                         1344
#define SSP1CON2_RCEN                 1345
#define SSP1CON2_ADMSK3               1346
#define SSP1CON2_ACKEN                1347
#define ACKEN1                        1348
#define ADMSK41                       1349
#define SSP1CON2_ADMSK4               1350
#define ACKDT1                        1351
#define ADMSK51                       1352
#define SSP1CON2_ACKDT                1353
#define SSP1CON2_ADMSK5               1354
#define SSP1CON2_ACKSTAT              1355
#define ACKSTAT1                      1356
#define GCEN1                         1357
#define SSP1CON2_GCEN                 1358
#define SSP1CON1                      1359
#define SSP1CON1_SSPM0                1360
#define SSPM01                        1361
#define SSP1CON1_SSPM                 1362
#define SSP1CON1_SSPM1                1363
#define SSPM11                        1364
#define SSP1CON1_SSPM2                1365
#define SSPM21                        1366
#define SSPM31                        1367
#define SSP1CON1_SSPM3                1368
#define SSP1CON1_CKP                  1369
#define CKP1                          1370
#define SSPEN1                        1371
#define SSP1CON1_SSPEN                1372
#define SSPOV1                        1373
#define SSP1CON1_SSPOV                1374
#define WCOL1                         1375
#define SSP1CON1_WCOL                 1376
#define SSP1STAT                      1377
#define BF1                           1378
#define SSP1STAT_BF                   1379
#define SSP1STAT_UA                   1380
#define UA1                           1381
#define SSP1STAT_R_NOT_W              1382
#define READ_WRITE                    1383
#define RW1                           1384
#define NOT_W                         1385
#define I2C_READ                      1386
#define nW                            1387
#define RW                            1388
#define nWRITE                        1389
#define R                             1390
#define NOT_WRITE                     1391
#define R_W                           1392
#define SSP1STAT_R_nW                 1393
#define SSP1STAT_S                    1394
#define START                         1395
#define START1                        1396
#define I2C_START                     1397
#define STOP                          1398
#define SSP1STAT_P                    1399
#define STOP1                         1400
#define I2C_STOP                      1401
#define SSP1STAT_D_NOT_A              1402
#define NOT_A                         1403
#define SSP1STAT_D_nA                 1404
#define nA                            1405
#define D_A                           1406
#define D                             1407
#define DA1                           1408
#define DA                            1409
#define DATA_ADDRESS                  1410
#define NOT_ADDRESS                   1411
#define nADDRESS                      1412
#define I2C_DAT                       1413
#define SSP1STAT_CKE                  1414
#define CKE1                          1415
#define SSP1STAT_SMP                  1416
#define SMP1                          1417
#define SSP1ADD                       1418
#define SSP1ADD_SSPADD                1419
#define SSP1ADD_MSK0                  1420
#define MSK01                         1421
#define SSP1ADD_MSK1                  1422
#define MSK11                         1423
#define SSP1ADD_MSK2                  1424
#define MSK21                         1425
#define MSK31                         1426
#define SSP1ADD_MSK3                  1427
#define SSP1ADD_MSK4                  1428
#define MSK41                         1429
#define MSK51                         1430
#define SSP1ADD_MSK5                  1431
#define SSP1ADD_MSK6                  1432
#define MSK61                         1433
#define MSK71                         1434
#define SSP1ADD_MSK7                  1435
#define SSP1MSK                       1436
#define SSP1MSK_MSK0                  1437
#define SSP1MSK_MSK1                  1438
#define SSP1MSK_MSK2                  1439
#define SSP1MSK_MSK3                  1440
#define SSP1MSK_MSK4                  1441
#define SSP1MSK_MSK5                  1442
#define SSP1MSK_MSK6                  1443
#define SSP1MSK_MSK7                  1444
#define SSP1BUF                       1445
#define SSP1BUF_SSPBUF                1446
#define T2CON                         1447
#define T2CKPS0                       1448
#define T2CKPS                        1449
#define T2CKPS1                       1450
#define TMR2ON                        1451
#define T2OUTPS0                      1452
#define T2OUTPS                       1453
#define T2OUTPS1                      1454
#define T2OUTPS2                      1455
#define T2OUTPS3                      1456
#define WM0                           1457
#define PR2                           1458
#define WM1                           1459
#define WAIT0                         1460
#define WAIT1                         1461
#define EBDIS                         1462
#define TMR2                          1463
#define T1CON                         1464
#define TMR1ON                        1465
#define T1CON_RD16                    1466
#define NOT_T1SYNC                    1467
#define nT1SYNC                       1468
#define T1OSCEN                       1469
#define SOSCEN                        1470
#define T1CKPS0                       1471
#define T1CKPS                        1472
#define T1CKPS1                       1473
#define TMR1CS0                       1474
#define TMR1CS                        1475
#define T1RD16                        1476
#define TMR1CS1                       1477
#define TMR1L                         1478
#define TMR1H                         1479
#define RCON                          1480
#define BOR                           1481
#define NOT_BOR                       1482
#define nBOR                          1483
#define POR                           1484
#define nPOR                          1485
#define NOT_POR                       1486
#define PD                            1487
#define nPD                           1488
#define NOT_PD                        1489
#define nTO                           1490
#define TO                            1491
#define NOT_TO                        1492
#define nRI                           1493
#define NOT_RI                        1494
#define RI                            1495
#define NOT_CM                        1496
#define CM                            1497
#define nCM                           1498
#define IPEN                          1499
#define CM2CON                        1500
#define CM2CON_CCH                    1501
#define CM2CON_CCH0                   1502
#define CCH02                         1503
#define CCH12                         1504
#define CM2CON_CCH1                   1505
#define CM2CON_CREF                   1506
#define CREF2                         1507
#define CM2CON_EVPOL                  1508
#define EVPOL02                       1509
#define CM2CON_EVPOL0                 1510
#define EVPOL12                       1511
#define CM2CON_EVPOL1                 1512
#define CM2CON_CPOL                   1513
#define CPOL2                         1514
#define CM2CON_COE                    1515
#define COE2                          1516
#define CM2CON_CON                    1517
#define CON2                          1518
#define CM1CON                        1519
#define CM1CON_CCH                    1520
#define C1CH0                         1521
#define CM1CON_CCH0                   1522
#define CCH01                         1523
#define CCH11                         1524
#define C1CH1                         1525
#define CM1CON_CCH1                   1526
#define CM1CON_CREF                   1527
#define CREF1                         1528
#define EVPOL01                       1529
#define CM1CON_EVPOL0                 1530
#define CM1CON_EVPOL                  1531
#define CM1CON_EVPOL1                 1532
#define EVPOL11                       1533
#define CM1CON_CPOL                   1534
#define CPOL1                         1535
#define CM1CON_COE                    1536
#define COE1                          1537
#define CM1CON_CON                    1538
#define CON1                          1539
#define OSCCON                        1540
#define SCS0                          1541
#define SCS                           1542
#define SCS1                          1543
#define OSTS                          1544
#define IRCF                          1545
#define IRCF0                         1546
#define IRCF1                         1547
#define IRCF2                         1548
#define IDLEN                         1549
#define T0CON                         1550
#define T0PS                          1551
#define T0PS0                         1552
#define T0PS1                         1553
#define T0PS2                         1554
#define PSA                           1555
#define T0SE                          1556
#define T0CS                          1557
#define T08BIT                        1558
#define TMR0ON                        1559
#define TMR0L                         1560
#define TMR0H                         1561
#define STATUS                        1562
#define C                             1563
#define CARRY                         1564
#define DC                            1565
#define ZERO                          1566
#define Z                             1567
#define OV                            1568
#define OVERFLOW                      1569
#define N                             1570
#define NEGATIVE                      1571
#define FSR2L                         1572
#define PLUSW2                        1573
#define PREINC2                       1574
#define POSTDEC2                      1575
#define POSTINC2                      1576
#define INDF2                         1577
#define FSR1L                         1578
#define PLUSW1                        1579
#define PREINC1                       1580
#define POSTDEC1                      1581
#define POSTINC1                      1582
#define INDF1                         1583
#define WREG                          1584
#define FSR0L                         1585
#define PLUSW0                        1586
#define PREINC0                       1587
#define POSTDEC0                      1588
#define POSTINC0                      1589
#define INDF0                         1590
#define INTCON3                       1591
#define INT1IF                        1592
#define INT1F                         1593
#define INT2IF                        1594
#define INT2F                         1595
#define INT3F                         1596
#define INT3IF                        1597
#define INT1E                         1598
#define INT1IE                        1599
#define INT2IE                        1600
#define INT2E                         1601
#define INT3E                         1602
#define INT3IE                        1603
#define INT1P                         1604
#define INT1IP                        1605
#define INT2IP                        1606
#define INT2P                         1607
#define INTCON2                       1608
#define RBIP                          1609
#define INT3IP                        1610
#define INT3P                         1611
#define TMR0IP                        1612
#define T0IP                          1613
#define INTEDG3                       1614
#define INTEDG2                       1615
#define INTEDG1                       1616
#define INTEDG0                       1617
#define RBPU                          1618
#define NOT_RBPU                      1619
#define nRBPU                         1620
#define INTCON                        1621
#define RBIF                          1622
#define INT0F                         1623
#define INT0IF                        1624
#define T0IF                          1625
#define TMR0IF                        1626
#define RBIE                          1627
#define INT0E                         1628
#define INT0IE                        1629
#define T0IE                          1630
#define TMR0IE                        1631
#define PEIE                          1632
#define PEIE_GIEL                     1633
#define GIEL                          1634
#define GIE_GIEH                      1635
#define GIE                           1636
#define GIEH                          1637
#define PRODL                         1638
#define PRODH                         1639
#define TABLAT                        1640
#define TBLPTRL                       1641
#define TBLPTRH                       1642
#define PCL                           1643
#define PCLATH                        1644
#define PCH                           1645
#define SP0                           1646
#define STKPTR                        1647
#define SP1                           1648
#define SP2                           1649
#define SP3                           1650
#define SP4                           1651
#define STKUNF                        1652
#define STKOVF                        1653
#define STKFUL                        1654
#define TOSL                          1655
#define TOSH                          1656

#endif // _PIC18LF27J13_H_
